[{"title":"Fall 2015","date":"Sept. 3 2015","text":"Welcome back! I hope everyone had a great summer and is ready to have a great semester. it's going to be a busy one. We have already welcomed 11 new brothers into our fraternity and we are hard at work with our philanthropy this week. So far we have gotten a lot of community support and the earnings for Feeding America are phenomenal. Keep making donations and bringing those cans!\n\nSoon we will be looking for young men who we believe convey our principles and who will contribute to make our fraternity better. If you are interested in coming out for rush you can take a look at this fall's rush events under the recruitment tab. Feel free to look around the rest of the site to get a better feel for who we are as a brotherhood.\n\nNew Members\n\nShiv Balodi\nWill Campbell\nMatheus Gomes\nNick Gray\nGrant Gsell\nReed Haubert\nJoe Hayes\nJoel Hierholzer\nThomas Hierholzer\nJustin Price\nGavin Scott\n\nBeat Ohio State!","img":"https://scontent.fash1-1.fna.fbcdn.net/hphotos-xpl1/v/t1.0-9/11217568_10207911154156074_7671944509893209690_n.jpg?oh=be5fd997d65ddd21f74b2058a0aebb83&oe=566FDF67"},{"title":"Spring 2015","date":"Jan. 26 2015","text":"I wanted to welcome everyone to a new semester and a new year. 2015 has so far welcomed a new High Zeta and 21 new members into our fraternity. The next two weeks are rush weeks and we will be working hard to recruit good men that will continue to benefit our chapter.\n\n2015 High Zeta\n\nPresident – Paolo Guma (Pictured Left)\nInternal Vice President – Blake Duncan\nExternal Vice President – Christopher Connorsn\nSecretary – Nicholas Perry\nTreasurer – James Chapman\nRisk Manager – Kyle Mahoney\nFraternity Educator – Justin Steele\nRecruitment Chairman – Peter Burns\nRecruitment Chairman – Brian Heffernan\nRitualist – Corey Rosenblatt\nEducational Chairman – Vangeli Tsakas\nSocial Chairman – Cormac McPherson\nAlumni Secretary – Theo Jolley\nAlumni Advisor – Nelson Thomas\nStandards Chairman – Shane Foley\nExecutive At Large – Emad Rahman\nExecutive At Large – Tyler Garman\nExecutive At Large – Matt Preziotti\n\nNew Members\n\nRiley Saunders\nChandler Crescentini\nTimmy Davis\nEmmet Devlin\nNicholas DiSarno\nJake Eubanks\nDavis Gardner\nRoss Hasek\nNoah Helgenberg\nDylan Kremp\nJoey Lamberto\nRyan Mahoney\nEric Marcus\nMichael Mauricio\nEric Meyer\nRoss Moreau\nSawyer Pardis\nJordon Prince\nPeyton Saunders\nKevin Welch\nPeter Wilson\nKevin Winder","img":"app/home/images/paolo.jpg"},{"title":"Thank You!","date":"Jan. 26 2015","text":"The Virginia Tech, Sigma Lambda, chapter of Lambda Chi Alpha would like to sincerely thank everyone who donated to aid our brother, Aaron O’Connell, in his time of need.\n\nThis past semester Aaron could not continue his education because he was diagnosed with cancer and spent the entire semester battling the disease in a hospital in his home state of South Carolina. Aaron’s combination of extraordinary will and mental toughness allowed him to keep his spirits up even in the darkest of moments. He never asked for any assistance through this ordeal, but as a fraternity, and as his brothers, we felt it our responsibility to show our support in his time of need. We opened our fund to the public to see if people would be willing to assist in our efforts and to our surprise we had an influx of responses from individuals, other Lambda Chi Alpha chapters, as well as other Greek organizations.\n\nBecause of everyone involved we were able to raise over $12,000 for Aaron. This money went to him and his family to help ease the financial strain brought on from this terrible disease.\n\n-Thank you for your generosity,\n\nLambda Chi Alpha at Virginia Tech","img":"app/home/images/aaron.jpg"},{"title":"Welcome","date":"Jan. 26 2015","text":"Through the vision of Lambda Chi Alpha the Sigma Lambda chapter prepares and encourages collegiate men of good character, high ethics, and noble ideals to contribute positively to the world in which they live.","img":"app/home/images/logo.gif"}]